#include<type.h>
#define IDTADDR 0x1C200H
#define IDTLIMIT 0x800H
/***********************************************************************************
中断初始化程序。
中断向量表放在0x1C200H。
所有中断方法无错误码则压入0，再压入中断处理函数地址后跳转至中断服务程序
由中断服务程序保存CPU上下文后呼叫栈中指示的中断处理程序。
返回后恢复上下文后IRET
全部指向中断服务程序

************************************************************************************/
void interup_server_route();   //中断处理程序
/**************************************************
装载IDTR
***************************************************/
void lidt(b32 base, b32 limit)
{
	b32 temp[2];
	temp[0] = limit << 16;
	temp[1] = base;
	asm volatile(
		"lidt (%0)"
		::"p"(((char *)temp) + 2)
		);
		
}
/***************************************************
设置interrupt

中断全用interrupt
***********************************************
装载idt..........未完成
****************************************************/
void idtload(int index,u32 addr)
{
	u32 temp[2];
	temp[0] = addr & 0xFFFF+0x080000;
	temp[1] = addr & 0xFFFF0000 | 0x8900;

}
void initidt()
{

	b32 base = IDTADDR;
	b32 limit = IDTLIMIT;
	lidt(base, limit);
}